author = input("Как тебя зовут? ").strip()

while author == "":
    print("Имя не может быть пустым. Пожалуйста, введите свое имя.")
    author = input("Как тебя зовут? ").strip()
    


city = input("В каком городе ты живешь? ").strip()
while city == "":
    print("Город не может быть пустым. Пожалуйста, введите название города.")
    city = input("В каком городе ты живешь? ").strip()

news = input("Что у тебя произошло за неделю? ").strip()

while news == "":
    print("Новость не может быть пустой. Пожалуйста, расскажи о своей неделе.")
    news = input("Что у тебя произошло за неделю? ").strip()

print(f"Автор: {author}")
print(f"Город: {city}")
print(f"Новость: {news}")